Revit 2027 API
Document.SeparateElements Method
Separate a set of combinable elements out of combinations they currently belong to.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SeparateElements(
	CombinableElementArray members
)
Public Sub SeparateElements (
	members As CombinableElementArray
)
public:
void SeparateElements(
	CombinableElementArray^ members
)
member SeparateElements :
        members : CombinableElementArray -> unit
Parameters
members CombinableElementArray
A list of combinable elements to be separated.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument is null.
ArgumentException |  Thrown when members is empty. Thrown when members contains null elements.
InvalidOperationException |  Thrown when separation failed.
Remarks
If geometry combination elements are passed as input, they will be completely separated and deleted. If generic forms that happen to belong to combination elements are passed, these forms will be removed from their geometry combination. The handles of geometry combinations completely removed by this operation are no longer valid.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace